In [1]:
import sqlite3

In [2]:
con= sqlite3.connect("emp_database.db")

In [3]:
def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee(id int primary key,name text,salary real,department text,position text,hiredate date )")
    con.commit()

In [4]:
# calling function

sql_table(con)

In [5]:
cur=con.cursor()
cur.execute("insert into employee values(1,'jack',9000,'HR','Manager','2019-07-09')")

In [8]:
con.commit

In [12]:
results=cur.execute('select * from employee')
results.fetchall()

[(1, 'jack', 9000.0, 'HR', 'Manager', '2019-07-09')]

In [13]:
# take input through function

In [17]:
def sql_insert(con,entities):
    cur=con.cursor()
    cur.execute("insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)",entities)

In [18]:
entities=(2,'Andrew',7000,'IT','Engineer','2015-04-06')

In [19]:
#calling sql insert to insert data

sql_insert(con,entities)

In [30]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Mohit', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales executive', '2018-02-19')]

In [22]:
entities=(3,'Thomas',6000,'HR','Manager','2016-06-14')
sql_insert(con,entities)

In [24]:
entities=(4,'Rudolf',8000,'IT','Engineer','2012-08-23')
sql_insert(con,entities)

In [25]:
entities=(5,'Suzen',10000,'Sales','Sales executive','2018-02-19')
sql_insert(con,entities)

In [27]:
# update entry

In [28]:
def sql_update(con):
    cur=con.cursor()
    cur.execute("update employee set name='Mohit' where id=1")
    con.commit()

In [29]:
sql_update(con)

In [31]:
results=cur.execute("select id,name from employee")
results.fetchall()

[(1, 'Mohit'), (2, 'Andrew'), (3, 'Thomas'), (4, 'Rudolf'), (5, 'Suzen')]

In [33]:
results=cur.execute("select id,name,salary from employee where salary>8000")
results.fetchall()

[(1, 'Mohit', 9000.0), (5, 'Suzen', 10000.0)]

In [34]:
results=cur.execute("select id,name from employee where department in ('HR')")
results.fetchall()

[(1, 'Mohit'), (3, 'Thomas')]

In [35]:
results=cur.execute("select min(salary) from employee")
results.fetchall()

[(6000.0,)]

In [36]:
results=cur.execute("select count(id) from employee")
results.fetchall()

[(5,)]

In [45]:
results=cur.execute("select distinct(department) from employee")
results.fetchall()

[('HR',), ('IT',), ('Sales',)]

In [38]:
results=cur.execute("select count(distinct(department)) from employee")
results.fetchall()

[(3,)]

In [46]:
results=cur.execute("select sum(salary),position from employee group by position")
results.fetchall()

[(15000.0, 'Engineer'), (15000.0, 'Manager'), (10000.0, 'Sales executive')]

In [47]:
results=cur.execute("select sum(salary),department from employee group by department")
results.fetchall()

[(15000.0, 'HR'), (15000.0, 'IT'), (10000.0, 'Sales')]

In [48]:
###

In [57]:
def sql_query(sql):
    cur=con.cursor()
    results=cur.execute(sql)
    return results.fetchall()

In [58]:
# makke query
sql="select * from employee"

# pass query in function
sql_query(sql)
#respond.fetchall()

[(1, 'Mohit', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales executive', '2018-02-19')]

In [60]:
# another query

sql=" select id,name,position from employee"

sql_query(sql)

[(1, 'Mohit', 'Manager'),
 (2, 'Andrew', 'Engineer'),
 (3, 'Thomas', 'Manager'),
 (4, 'Rudolf', 'Engineer'),
 (5, 'Suzen', 'Sales executive')]

#    SQlite3 Executemany ( Bulk insert)

In [61]:
#executemany can be used to insert many rows once

In [64]:
## Reference id

In [65]:
db= sqlite3.connect("student_course_database.db")

In [66]:
cur=db.cursor()

In [67]:
contraints...
unique-  enter only unique values, no duplicate values
not null  -  no blnk values cn be inserted in table

SyntaxError: invalid syntax (<ipython-input-67-d772bff76461>, line 1)

In [68]:
cur.execute("create table course(courseid int primary key,coursename text, duration int)")

In [69]:
cur.execute("create table student(roll_no int primary key, studentname text, age int, courseid int, foreign key(courseid) references course(courseid))")

In [74]:
cur.execute("insert into course values(78,'Data Science',12),(56,'Python course',4),(101,'Database',7)")

IntegrityError: UNIQUE constraint failed: course.courseid

In [73]:
print(cur.rowcount)

-1

In [75]:
cur.execute("insert into student values(1,'Jack',22,78),(2,'John',21,56),(3,'Rudolf',18,78),(4,'Jim',21,56)")
print(cur.rowcount)

4

In [77]:
results=cur.execute("select * from student")
results.fetchall()

[(1, 'Jack', 22, 78),
 (2, 'John', 21, 56),
 (3, 'Rudolf', 18, 78),
 (4, 'Jim', 21, 56)]

In [78]:
results=cur.execute("select * from course")
results.fetchall()

[(78, 'Data Science', 12), (56, 'Python course', 4), (101, 'Database', 7)]

In [85]:
results=cur.execute('select courseid from course where coursename="Data Science"')
for i in results:
    print(i)

(78,)

In [83]:
# Subquery

In [86]:
results= cur.execute('select * from student where courseid=(select courseid from course where course="Data Science")')

OperationalError: no such column: course